Hi @eissko, we're facing the same issue with app gateway public ip zones addition while updating azurerm version.

Before upgrade my resource "azurerm_public_ip" hadn't defined the "zones" in the tf configuration and automatically got assigned [1,2,3] - we also checked this via Azure Portal.

But after AzureRM upgrade to 3.14.0 from 2.99.0 terraform wanted to recreate the resource "azurerm_public_ip" due to mismatch at "zones" attribute like depicted below:

``` # azurerm_public_ip.pubip must be replaced
-/+ resource "azurerm_public_ip" "pubip" {
    ~ fqdn                    = "*****" -> (known after apply)
    ~ id                      = "/subscriptions/****" -> (known after apply)
    ~ ip_address              = "x.x.x.x" -> (known after apply)
    - ip_tags                 = {} -> null
        name                    = "*****"
    ~ tags                    = {
            # (10 unchanged elements hidden)
        }
    - zones                   = [
        - "1",
        - "2",
        - "3",
        ] -> null # forces replacement
        # (8 unchanged attributes hidden)
    }
```